#define ANSI_CHARSET            0
#define DEFAULT_CHARSET         1
#define SYMBOL_CHARSET          2
#define SHIFTJIS_CHARSET        128
#define HANGEUL_CHARSET         129
#define HANGUL_CHARSET          129
#define GB2312_CHARSET          134
#define CHINESEBIG5_CHARSET     136
#define OEM_CHARSET             255
#if(WINVER >= 0x0400)
#define JOHAB_CHARSET           130
#define HEBREW_CHARSET          177
#define ARABIC_CHARSET          178
#define GREEK_CHARSET           161
#define TURKISH_CHARSET         162
#define VIETNAMESE_CHARSET      163
#define THAI_CHARSET            222
#define EASTEUROPE_CHARSET      238
#define RUSSIAN_CHARSET         204

#define MAC_CHARSET             77
#define BALTIC_CHARSET          186

;=== 操作员界面中文字体设置===                                                   
[OPERATOR_FONT_CN]                                                          
TITLE_FONT_SIZE = 20;			// 标题字体大小             
TITLE_FONT_NAME = Simsun;			// 标题字体名称 
TITLE_FONT_COLOR = 0;			// 标题字体颜色

BUTTON_FONT_SIZE = 15;			// 按钮字体大小(暂不使用)           
BUTTON_FONT_NAME = Simsun;		// 按钮字体名称(暂不使用)   
BUTTON_FONT_COLOR = 65280;		// 按钮字体颜色   
        
NORMAL_FONT_SIZE = 20;			// 基本信息区正文字体大小            
NORMAL_FONT_NAME = 黑体;		// 基本信息区正文字体名称     
NORMAL_FONT_COLOR = 0;			// 基本信息区正文字体颜色     

OPERATOR_GUIDE_FONT_SIZE= 20;		// 向导信息区字体大小      
OPERATOR_GUIDE_FONT_NAME = Simsun;	// 向导信息区字体名称 
OPERATPR_GUIDE_FONT_COLOR = 0;		// 向导信息区字体颜色
      
INI_FONT_SIZE= 20;			// 初始化界面字体大小   
INI_FONT_NAME = Simsun;	// 初始化界面字体名称 
INI_FONT_COLOR = 0;			// 初始化界面字体颜色
INI_RESULT_SUCCES_FONT_COLOR = 0;	// 初始化结果成功的字体颜色
INI_RESULT_FAILED_FONT_COLOR = 255;	// 初始化结果失败的字体大小
INI_RESULT_UNKNOW_FONT_COLOR = 0;	// 初始化结果未知的字体名称
   
CHARSET = 134;				// 字符集         
                                                                   
;=== 操作员界面英文字体设置 ===                                                   
[OPERATOR_FONT_EN]                                                          
TITLE_FONT_SIZE = 22;			// 标题字体大小         
TITLE_FONT_NAME = Arial;		// 标题字体名称
TITLE_FONT_COLOR = 0;			// 标题字体颜色

BUTTON_FONT_SIZE = 22;			// 按钮字体大小(暂不使用)            
BUTTON_FONT_NAME = Arial;		// 按钮字体名称(暂不使用)     
BUTTON_FONT_COLOR = 0;			// 按钮字体颜色
                 
NORMAL_FONT_SIZE = 22;			// 基本信息区正文字体大小           
NORMAL_FONT_NAME = Arial;		// 基本信息区正文字体名称  
NORMAL_FONT_COLOR = 0;			// 基本信息区正文字体颜色
          
OPERATOR_GUIDE_FONT_SIZE= 22;		// 向导信息区字体大小        
OPERATOR_GUIDE_FONT_NAME = Arial; 	// 向导信息区字体名称   
OPERATOR_GUIDE_FONT_COLOR = 0;		// 向导信息区字体颜色
     
INI_FONT_SIZE= 22;			// 初始化界面字体大小   
INI_FONT_NAME = Arial;			// 初始化界面字体名称    
INI_FONT_COLOR = 0;			// 初始化界面字体颜色
    
CHARSET = 0;				// 字符集                
                                                                   
;=== 操作员界面葡文字体设置 ===                                                   
[OPERATOR_FONT_PN]                                                          
TITLE_FONT_SIZE = 18;			// 标题字体大小         
TITLE_FONT_NAME = Arial;		// 标题字体名称  
TITLE_FONT_COLOR = 0;			// 标题字体颜色

BUTTON_FONT_SIZE = 18;			// 按钮字体大小(暂不使用)              
BUTTON_FONT_NAME = Arial;		// 按钮字体名称(暂不使用)   
BUTTON_FONT_COLOR = 0;			// 按钮字体颜色
            
NORMAL_FONT_SIZE = 16;			// 基本信息区正文字体大小          
NORMAL_FONT_NAME = Arial;		// 基本信息区正文字体名称  
NORMAL_FONT_COLOR = 0;			// 基本信息区正文字体颜色
            
OPERATOR_GUIDE_FONT_SIZE= 18;		// 向导信息区字体大小     
OPERATOR_GUIDE_FONT_NAME = Arial;	// 向导信息区字体名称   
OPERATOR_GUIDE_FONT_COLOR = 0;		// 向导信息区字体名称
       
INI_FONT_SIZE= 18;			// 初始化界面字体大小    
INI_FONT_NAME = Arial;			// 初始化界面字体名称      
INI_FONT_COLOR = 255;			// 初始化界面字体颜色
    
CHARSET = 0;				// 字符集                
                                                             
;=== 乘客界面文字设置 ===                                                   
[CLIENT_FONT]                                                          
STATION_FONT_SIZE_CN = 50;		// 状态栏车站名称字体大小(中文)             
STATION_FONT_NAME_CN = 黑体;		// 状态栏车站名称字体名称(中文)
STATION_FONT_COLOR_CN = 783359;	// 状态栏车站名称字体颜色(中文)
STATION_FONT_SIZE_EN = 50;		// 状态栏车站名称字体大小(英文)          
STATION_FONT_NAME_EN = Arial;		// 状态栏车站名称字体名称(英文) 
STATION_FONT_COLOR_EN = 783359;	// 状态栏车站名称字体颜色(英文)             
STATION_FONT_SIZE_PN = 30;		// 状态栏车站名称字体大小(葡文)            
STATION_FONT_NAME_PN = Arial;		// 状态栏车站名称字体名称(葡文) 
STATION_FONT_COLOR_PN = 16777215;       // 状态栏车站名称字体颜色(葡文)
     
DATE_FONT_SIZE_CN = 30;			// 状态栏日期时间字体大小(中文)          
DATE_FONT_NAME_CN = 黑体;		// 状态栏日期时间字体名称(中文)
DATE_FONT_COLOR_CN = 16777215;		// 状态栏日期时间字体颜色(中文)
DATE_FONT_SIZE_EN = 30;			// 状态栏日期时间字体大小(英文)               
DATE_FONT_NAME_EN = 黑体;		// 状态栏日期时间字体名称(英文)   
DATE_FONT_COLOR_EN = 16777215;		// 状态栏日期时间字体颜色(英文)               
DATE_FONT_SIZE_PN = 26;			// 状态栏日期时间字体大小(葡文)           
DATE_FONT_NAME_PN = Arial;		// 状态栏日期时间字体名称(葡文)  
DATE_FONT_COLOR_PN = 16777215;		// 状态栏日期时间字体颜色(葡文) 

SVC_STATE_FONT_SIZE_CN = 38;		// 状态栏服务状态字体大小(中文)
SVC_STATE_FONT_NAME_CN = 黑体;		// 状态栏服务状态字体大小(中文)
SVC_STATE_FONT_SIZE_EN = 38;		// 状态栏服务状态字体大小(英文)
SVC_STATE_FONT_NAME_EN = 黑体;		// 状态栏服务状态字体大小(英文)
SVC_STATE_FONT_SIZE_PN = 26;		// 状态栏服务状态字体大小(葡文)
SVC_STATE_FONT_NAME_PN = Arial;		// 状态栏服务状态字体大小(葡文)

SVC_STATE_FONT_COLOR_NORMAL = 16777215;		// 状态栏服务状态字体颜色(正常)
SVC_STATE_FONT_COLOR_UNNORM = 255;		// 状态栏服务状态字体颜色(不正常)    
             
TITLE_FONT_SIZE_CN = 45;		// 基本信息区标题字体大小(中文)             
TITLE_FONT_NAME_CN = 黑体;		// 基本信息区标题字体名称(中文) 
TITLE_FONT_COLOR_CN = 0;          	// 基本信息区标题字体颜色(中文)
TITLE_FONT_SIZE_EN = 45;		// 基本信息区标题字体大小(英文)           
TITLE_FONT_NAME_EN = Arial;		// 基本信息区标题字体名称(英文)
TITLE_FONT_COLOR_EN = 0;         	// 基本信息区标题字体颜色(英文)             
TITLE_FONT_SIZE_PN = 45;		// 基本信息区标题字体大小(葡文)             
TITLE_FONT_NAME_PN = Arial;		// 基本信息区标题字体名称(葡文)
TITLE_FONT_COLOR_PN = 0;          	// 基本信息区标题字体颜色(葡文)    
         
BASEINFO_FONT_SIZE_CN = 28;		// 基本信息区正文字体大小(中文)           
BASEINFO_FONT_NAME_CN = 黑体;		// 基本信息区正文字体名称(中文)
BASEINFO_FONT_COLOR_CN = 0		// 基本信息区正文字体颜色(中文)     
BASEINFO_FONT_SIZE_EN = 28;		// 基本信息区正文字体大小(英文)            
BASEINFO_FONT_NAME_EN = Arial;		// 基本信息区正文字体名称(英文)
BASEINFO_FONT_COLOR_EN = 0;		// 基本信息区正文字体颜色(英文)           
BASEINFO_FONT_SIZE_PN = 35;		// 基本信息区正文字体大小(葡文)              
BASEINFO_FONT_NAME_PN = Arial;		// 基本信息区正文字体名称(葡文) 
BASEINFO_FONT_COLOR_PN = 0;		// 基本信息区正文字体颜色(葡文)    
        
GUIDEINFO_FONT_SIZE_CN = 30;		// 向导信息区字体大小(中文)             
GUIDEINFO_FONT_NAME_CN = 黑体;		// 向导信息区字体名称(中文) 
GUIDEINFO_FONT_COLOR_CN= 255;		// 向导信息区字体颜色(中文)
GUIDEINFO_FONT_SIZE_EN = 30;		// 向导信息区字体大小(英文)               
GUIDEINFO_FONT_NAME_EN = Arial;		// 向导信息区字体名称(英文)
GUIDEINFO_FONT_COLOR_EN= 255;		// 向导信息区字体颜色(英文)               
GUIDEINFO_FONT_SIZE_PN = 20;		// 向导信息区字体大小(葡文)               
GUIDEINFO_FONT_NAME_PN = Arial;		// 向导信息区字体名称(葡文)  
GUIDEINFO_FONT_COLOR_PN= 0;		// 向导信息区字体颜色(葡文) 
  
MESSAGEBOX_FONT_SIZE_CN = 20;		// 消息提示框正文字体大小(中文)               
MESSAGEBOX_FONT_NAME_CN = 黑体;		// 消息提示框正文字体名称(中文) 
MESSAGEBOX_FONT_COLOR_CN = 0;		// 消息提示框正文字体颜色(中文) 
MESSAGEBOX_FONT_SIZE_EN = 20;		// 消息提示框正文字体大小(英文)             
MESSAGEBOX_FONT_NAME_EN = Arial;        // 消息提示框正文字体名称(英文)
MESSAGEBOX_FONT_COLOR_EN = 0;		// 消息提示框正文字体颜色(英文)               
MESSAGEBOX_FONT_SIZE_PN = 20;		// 消息提示框正文字体大小(葡文)          
MESSAGEBOX_FONT_NAME_PN = Arial;        // 消息提示框字体名称名称(葡文)
MESSAGEBOX_FONT_COLOR_PN = 0;		// 消息提示框正文字体颜色(葡文) 
   
MESSAGEBOXTITLE_FONT_SIZE_CN = 30;	// 消息提示框标题字体大小(中文)             
MESSAGEBOXTITLE_FONT_NAME_CN = 黑体;	// 消息提示框标题字体名称(中文)
MESSAGEBOXTITLE_FONT_COLOR_CN = 0;	// 消息提示框标题字体颜色(中文)      
MESSAGEBOXTITLE_FONT_SIZE_EN = 30;	// 消息提示框标题字体大小(英文)              
MESSAGEBOXTITLE_FONT_NAME_EN = Arial;	// 消息提示框标题字体名称(英文)   
MESSAGEBOXTITLE_FONT_COLOR_EN = 0;	// 消息提示框标题字体颜色(英文)         
MESSAGEBOXTITLE_FONT_SIZE_PN = 30;	// 消息提示框标题字体大小(葡文)               
MESSAGEBOXTITLE_FONT_NAME_PN = Arial;	// 消息提示框标题字体名称(葡文) 
MESSAGEBOXTITLE_FONT_COLOR_PN = 0;	// 消息提示框标题字体颜色(葡文)
 
FUNCTION_BUTTON_FONT_SIZE_CN = 30;	// 功能按钮字体大小(中文)             
FUNCTION_BUTTON_FONT_NAME_CN = 黑体;	// 功能按钮字体名称(中文)   
FUNCTION_BUTTON_FONT_COLOR_CN =0;// 功能按钮字体颜色(中文)
FUNCTION_BUTTON_FONT_SIZE_EN = 30;	// 功能按钮字体大小(英文)            
FUNCTION_BUTTON_FONT_NAME_EN = Arial;	// 功能按钮字体名称(英文)  
FUNCTION_BUTTON_FONT_COLOR_EN = 0;// 功能按钮字体颜色(英文)
FUNCTION_BUTTON_FONT_SIZE_PN = 18;	// 功能按钮字体大小(葡文)        
FUNCTION_BUTTON_FONT_NAME_PN = Arial;	// 功能按钮字体名称(葡文)
FUNCTION_BUTTON_FONT_COLOR_PN = 0;// 功能按钮字体颜色(葡文)

MENU_BUTTON_FONT_SIZE_CN = 20;		// 菜单按钮字体大小(中文)             
MENU_BUTTON_FONT_NAME_CN = 黑体;	// 菜单按钮字体名称(中文)  
MENU_BUTTON_FONT_COLOR_CN = 16777215;	// 菜单按钮字体颜色(中文) 
MENU_BUTTON_FONT_SIZE_EN = 20;		// 菜单按钮字体大小(英文)            
MENU_BUTTON_FONT_NAME_EN = Arial;	// 菜单按钮字体名称(英文)  
MENU_BUTTON_FONT_COLOR_EN = 16777215;	// 菜单按钮字体颜色(英文) 
MENU_BUTTON_FONT_SIZE_PN = 20;		// 菜单按钮字体大小(葡文)        
MENU_BUTTON_FONT_NAME_PN = Arial;	// 菜单按钮字体名称(葡文)
MENU_BUTTON_FONT_COLOR_PN = 16777215;	// 菜单按钮字体颜色(葡文) 

FUNCTION_BUTTON_GROUP_TITLE_FONT_SIZE_CN = 20;		// 功能按钮区标题字体大小(中文)
FUNCTION_BUTTON_GROUP_TITLE_FONT_NAME_CN = 黑体;	// 功能按钮区标题字体名称(中文)
FUNCTION_BUTTON_GROUP_TITLE_FONT_COLOR_CN = 16777215;	// 功能按钮区标题字体颜色(中文)

FUNCTION_BUTTON_GROUP_TITLE_FONT_SIZE_EN = 20;		// 功能按钮区标题字体大小(英文)     
FUNCTION_BUTTON_GROUP_TITLE_FONT_NAME_EN = 黑体;	// 功能按钮区标题字体名称(英文)
FUNCTION_BUTTON_GROUP_TITLE_FONT_COLOR_EN = 16777215;		// 功能按钮区标题字体颜色(英文)   

FUNCTION_BUTTON_GROUP_TITLE_FONT_SIZE_PN = 20;		// 功能按钮区标题字体大小(葡文)     
FUNCTION_BUTTON_GROUP_TITLE_FONT_NAME_PN = Arial Black;	// 功能按钮区标题字体名称(葡文)
FUNCTION_BUTTON_GROUP_TITLE_FONT_COLOR_PN = 16777215;		// 功能按钮区标题字体颜色(葡文) 

SERVICE_STATE_TXT_FONT_NAME_CN = 黑体;			// 服务状态（暂停服务，正常服务。。。）字体
SERVICE_STATE_TXT_FONT_NAME_EN = Arial;
SERVICE_STATE_TXT_FONT_NAME_PN = Arial;

SERVICE_STATE_TXT_FONT_SIZE_CN = 100;			// 服务状态字体大小
SERVICE_STATE_TXT_FONT_SIZE_EN = 100;
SERVICE_STATE_TXT_FONT_SIZE_PN = 100;

SERVICE_STATE_TXT_FONT_COLOR_CN = 255;			// 服务装太字体颜色
SERVICE_STATE_TXT_FONT_COLOR_EN = 255;
SERVICE_STATE_TXT_FONT_COLOR_PN = 255;

HISTORY_GRID_TXT_FONT_NAME_CN = 黑体;			// 票卡交易历史记录表格字体
HISTORY_GRID_TXT_FONT_NAME_EN = Arial;
HISTORY_GRID_TXT_FONT_NAME_PN = Arial;

HISTORY_GRID_TXT_FONT_SIZE_CN = 15;
HISTORY_GRID_TXT_FONT_SIZE_EN = 15;
HISTORY_GRID_TXT_FONT_SIZE_PN = 15;

HISTORY_GRID_TXT_FONT_COLOR_CN = 0;
HISTORY_GRID_TXT_FONT_COLOR_EN = 0;
HISTORY_GRID_TXT_FONT_COLOR_PN = 0;
  
LOGO_FONT_SIZE_CN = 18;			// LOGO区字体大小(中文)             
LOGO_FONT_NAME_CN = 黑体;		// LOGO区字体名称(中文) 
LOGO_FONT_COLOR_CN = 0;			// LOGO区字体颜色(中文)  
LOGO_FONT_SIZE_EN = 18;			// LOGO区字体大小(英文)            
LOGO_FONT_NAME_EN = 黑体;		// LOGO区字体名称(英文)  
LOGO_FONT_COLOR_EN = 0;			// LOGO区字体颜色(英文) 
LOGO_FONT_SIZE_PN = 18;			// LOGO区字体大小(葡文)        
LOGO_FONT_NAME_PN = Arial;		// LOGO区字体名称(葡文)
LOGO_FONT_COLOR_PN = 0;			// LOGO区字体颜色(葡文) 
VERSION_INFO_FONT_SIZE = 15;		// 版本信息字体大小

;=== 乘客界面颜色设置 ===                                                 
[GUI_COLOR]                                                        
TITLE_AREA_COLOR = 15646865;		// 乘客界面状态信息区背景色 
BASE_AREA_COLOR = 15581841;		// 乘客界面基本信息区背景色  15855852
STATUS_AREA_COLOR = 15855852;		// 乘客界面向导信息区背景色  
FUNCTION_AREA_COLOR = 16777215;		// 乘客界面功能按钮信息区背景色6500864

;=== 站员界面颜色设置 ===       
[OPERATOR_GUI_COLOR]         
STATUS_AREA_COLOR = 6500864;		// 站员界面状态信息区背景色 6500864
GUIDE_AREA_COLOR = 15855852;		// 站员界面向导信息区背景色(文言提示区) 6763776
BASE_AREA_COLOR = 15855852;		// 站员界面基本信息区背景色  15855852
FUNCTION_AREA_COLOR = 6500864;		// 站员界面导航信息区背景色 6763776

;=== 站员界面分辨率设置 ===
[OPERATOR_RESOLUTION]
WIDTH = 800;				// 站员界面分辨率宽 （以800为基准）
HEIGHT = 600;				// 站员界面分辨率高 （以600为基准）

;=== 乘客界面分辨率设置 ===
[RECEPTION_RESOLUTION]
WIDTH = 1920;				// 乘客画面分辨率宽（以1280为基准）
HEIGHT = 1080;				// 乘客换面分辨率高（以1024为基准）
